IRP/src/Documents/AdditionalCostAllocation/AdditionalCostAllocation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>AdditionalCostAllocation</name>
 <registerRecords>InformationRegister.T6060S_BatchCostAllocationInfo</registerRecords>
 <registerRecords>InformationRegister.T6020S_BatchKeysInfo</registerRecords>
 <registerRecords>AccumulationRegister.R6060T_CostOfGoodsSold</registerRecords>
 <registerRecords>AccumulationRegister.T1050T_AccountingQuantities</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R6070T_OtherPeriodsExpenses</registerRecords>
 <registerRecords>AccumulationRegister.R6020B_BatchBalance</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>AllocationMode</name>
  <type>
   <types>EnumRef.AllocationMode</types>
  </type>
 </attributes>
 <attributes>
  <name>AllocationMethod</name>
  <type>
   <types>EnumRef.AllocationMethod</types>
  </type>
 </attributes>
 <tabularSections>
  <name>CostList</name>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Basis</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AllocationList</name>
  <attributes>
   <name>BasisRowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Document</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>CostDocuments</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Document</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AllocationDocuments</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Document</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AllocationResult</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>BasisRowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpensePurchaseInvoice</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseItem</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>PurchaseInvoice</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/InformationRegisters/T6020S_BatchKeysInfo/T6020S_BatchKeysInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>T6020S_BatchKeysInfo</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <dimensions>
    <name>Direction</name>
    <type>
      <types>EnumRef.BatchDirection</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BatchDocument</name>
    <type>
      <types>DocumentRef.Bundling</types>
      <types>DocumentRef.InventoryTransfer</types>
      <types>DocumentRef.ItemStockAdjustment</types>
      <types>DocumentRef.OpeningEntry</types>
      <types>DocumentRef.PurchaseInvoice</types>
      <types>DocumentRef.PurchaseReturn</types>
      <types>DocumentRef.RetailReturnReceipt</types>
      <types>DocumentRef.RetailSalesReceipt</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.SalesReturn</types>
      <types>DocumentRef.StockAdjustmentAsSurplus</types>
      <types>DocumentRef.StockAdjustmentAsWriteOff</types>
      <types>DocumentRef.Unbundling</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SalesInvoice</name>
    <type>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.RetailSalesReceipt</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RowID</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/BatchDirection/BatchDirection.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>BatchDirection</name>
 <enumValues>
  <name>Receipt</name>
 </enumValues>
 <enumValues>
  <name>Expense</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/AdditionalCostAllocation/Forms/FormSelectAllocationRows/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ThisObject.BasisRowID = Parameters.BasisRowID;
	List.Parameters.SetParameterValue("Company", Parameters.Company);
	
	If Parameters.SelectedRows.Count() Then
		SelectedRowsTable = New ValueTable();
		SelectedRowsTable.Columns.Add("Use");
		SelectedRowsTable.Columns.Add("BasisRowID");
		SelectedRowsTable.Columns.Add("RowID");
		SelectedRowsTable.Columns.Add("Document");
		SelectedRowsTable.Columns.Add("Store");
		SelectedRowsTable.Columns.Add("ItemKey");
		For Each Row In Parameters.SelectedRows Do
			FillPropertyValues(SelectedRowsTable.Add(), Row);
		EndDo;
		SelectedRowsTable.FillValues(True, "Use");
		SelectedRowsTableCopy = SelectedRowsTable.Copy();
		SelectedRowsTableCopy.GroupBy("Document");
		For Each Row In SelectedRowsTableCopy Do
			SaveRowsToResultTree(Row.Document, SelectedRowsTable.Copy(New Structure("Document", Row.Document)));
		EndDo;
		ClearDocumentsWithOutRows();
	EndIf;
	
	Items.GroupRowEditor.CurrentPage = Items.GroupDocuments;
EndProcedure

&AtClient
Procedure Ok(Command)
	ArrayOfSelectedRows = New Array();
	For Each Row_TopLevel In ThisObject.ResultTree.GetItems() Do
		For Each Row_Second_Level In Row_TopLevel.GetItems() Do
			SelectedRow = New Structure();
			SelectedRow.Insert("BasisRowID", ThisObject.BasisRowID);
			SelectedRow.Insert("RowID"     , Row_Second_Level.RowID);
			SelectedRow.Insert("Document"  , Row_Second_Level.Document);
			SelectedRow.Insert("Store"     , Row_Second_Level.Store);
			SelectedRow.Insert("ItemKey"   , Row_Second_Level.ItemKey);
			ArrayOfSelectedRows.Add(SelectedRow);
		EndDo;
	EndDo;
	Close(New Structure("SelectedRows, BasisRowID", ArrayOfSelectedRows, ThisObject.BasisRowID));	
EndProcedure

&AtClient
Procedure Cancel(Command)
	Close(Undefined);
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
		AttachIdleHandler("ExpandAllTrees", 1, True);
EndProcedure

&AtClient
Procedure ExpandAllTrees() Export
	RowIDInfoClient.ExpandTree(Items.ResultTree, ThisObject.ResultTree.GetItems());
EndProcedure

&AtClient
Procedure SwitchToSelectRowsStep()
	CurrentData = Items.List.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	FillDocumentRows(CurrentData.Document, ThisObject.BasisRowID);
	Items.GroupRowEditor.CurrentPage = Items.GroupRows;
EndProcedure

&AtServer
Procedure FillDocumentRows(Document, BasisRowID)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	&BasisRowID AS BasisRowID,
	|	T6020S_BatchKeysInfo.RowID,
	|	T6020S_BatchKeysInfo.Recorder AS Document,
	|	T6020S_BatchKeysInfo.Store,
	|	T6020S_BatchKeysInfo.ItemKey
	|FROM
	|	InformationRegister.T6020S_BatchKeysInfo AS T6020S_BatchKeysInfo
	|WHERE
	|	T6020S_BatchKeysInfo.Recorder = &Document
	|	AND T6020S_BatchKeysInfo.RowID <> """"
	|	AND T6020S_BatchKeysInfo.Direction = VALUE(Enum.BatchDirection.Receipt)
	|	AND T6020S_BatchKeysInfo.Recorder REFS Document.PurchaseInvoice";
	Query.SetParameter("Document", Document);
	Query.SetParameter("BasisRowID", BasisRowID);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	ThisObject.DocumentRows.Clear();
	While QuerySelection.Next() Do
		NewRow = ThisObject.DocumentRows.Add();
		FillPropertyValues(NewRow, QuerySelection);
		For Each Row_TopLevel In ThisObject.ResultTree.GetItems() Do
			For Each Row_Second_Level In Row_TopLevel.GetItems() Do
				If Row_Second_Level.RowID = QuerySelection.RowID 
					And Row_Second_Level.Document = QuerySelection.Document Then
						NewRow.Use = True;
				EndIf;
			EndDo;
		EndDo;
	EndDo;
EndProcedure

&AtClient
Procedure SelectDocument(Command)
	SwitchToSelectRowsStep();
EndProcedure

&AtClient
Procedure ListSelection(Item, RowSelected, Field, StandardProcessing)
	SwitchToSelectRowsStep();
EndProcedure

&AtClient
Procedure EditorCancel(Command)
	Items.GroupRowEditor.CurrentPage = Items.GroupDocuments;
EndProcedure

&AtClient
Procedure EditorOk(Command)
	If ThisObject.DocumentRows.Count() Then
		Document = ThisObject.DocumentRows[0].Document;
		ArrayOfRows = New Array();
		For Each Row In ThisObject.DocumentRows Do
			NewRow = New Structure("Use, BasisRowID, RowID, Document, Store, ItemKey");
			FillPropertyValues(NewRow, Row);
			ArrayOfRows.Add(NewRow);
		EndDo;
		SaveRowsToResultTree(Document, ArrayOfRows);
	EndIf;
	ClearDocumentsWithOutRows();
	RowIDInfoClient.ExpandTree(Items.ResultTree, ThisObject.ResultTree.GetItems());
	Items.GroupRowEditor.CurrentPage = Items.GroupDocuments;
EndProcedure

&AtServer
Procedure SaveRowsToResultTree(Document, RowsForSave)
	DocumentFound = False;
	For Each Row_TopLevel In ThisObject.ResultTree.GetItems() Do
		If Row_TopLevel.Document = Document Then
			DocumentFound = True;
			Break;
		EndIf;
	EndDo;
	If Not DocumentFound Then
		Row_TopLevel = ThisObject.ResultTree.GetItems().Add();
		Row_TopLevel.Level = 1;
		Row_TopLevel.Document = Document;
	Else
		Row_TopLevel.GetItems().Clear();
	EndIf;
	For Each Row In RowsForSave Do
		If Not Row.Use Then
			Continue;
		EndIf;
		NewRow_SecondLevel = Row_TopLevel.GetItems().Add();
		NewRow_SecondLevel.Level = 2;
		FillPropertyValues(NewRow_SecondLevel, Row);
	EndDo;
EndProcedure

&AtServer
Procedure ClearDocumentsWithOutRows();
	ArrayForDelete = New Array();
	For Each Row In ThisObject.ResultTree.GetItems() Do
		If Not Row.GetItems().Count() Then
			ArrayForDelete.Add(Row);
		EndIf;
	EndDo;
	For Each ItemForDelete In ArrayForDelete Do
		ThisObject.ResultTree.GetItems().Delete(ItemForDelete);
	EndDo;
EndProcedure

&AtClient
Procedure ResultTreeBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure ResultTreeBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

&AtClient
Procedure DocumentRowsBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure DocumentRowsBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

&AtClient
Procedure ShowRowKey(Command)
	DocumentsClient.ShowRowKey(ThisObject);
EndProcedure
